[
  {"input": "The quick brown fox jumps over the lazy dog. The dog was sleeping peacefully in the sun.", "expected_output": "A fox jumps over a sleeping dog."},
  {"input": "Scientists have discovered a new species of deep-sea fish that can produce its own light through bioluminescence. The fish was found at depths of over 3000 meters.", "expected_output": "A new bioluminescent deep-sea fish species was discovered at depths exceeding 3000 meters."},
  {"input": "The company reported record quarterly earnings of $5.2 billion, driven primarily by strong growth in cloud computing services and advertising revenue.", "expected_output": "The company earned a record $5.2B quarterly, led by cloud and advertising growth."},
  {"input": "Researchers at MIT have developed a new type of battery that uses aluminum and sulfur, which are cheap and abundant materials. The battery can be manufactured at much lower cost than lithium-ion batteries.", "expected_output": "MIT researchers created a cheaper battery using aluminum and sulfur as alternatives to lithium-ion."},
  {"input": "The city council voted 7-2 to approve the new public transit expansion plan, which will add three new bus routes and extend the subway system by 12 miles over the next five years.", "expected_output": "City council approved a transit expansion adding 3 bus routes and 12 miles of subway over 5 years."},
  {"input": "A study published in Nature found that regular exercise can reduce the risk of developing dementia by up to 30 percent, even in people with genetic predisposition to the disease.", "expected_output": "Regular exercise reduces dementia risk by up to 30%, even for genetically predisposed individuals."},
  {"input": "The restaurant industry saw a 15% increase in online orders during the first quarter, with delivery apps accounting for 60% of all digital orders placed.", "expected_output": "Restaurant online orders rose 15% in Q1, with delivery apps handling 60% of digital orders."},
  {"input": "NASA's James Webb Space Telescope captured unprecedented images of a galaxy cluster 4.6 billion light-years away, revealing previously unseen details about early universe formation.", "expected_output": "JWST imaged a galaxy cluster 4.6B light-years away, revealing new details about early universe formation."},
  {"input": "The government announced a $2 trillion infrastructure bill that includes funding for roads, bridges, broadband internet expansion, and clean energy projects across all 50 states.", "expected_output": "A $2T infrastructure bill will fund roads, bridges, broadband, and clean energy nationwide."},
  {"input": "Coffee consumption worldwide has reached an all-time high of 170 million bags annually, with Brazil remaining the largest producer and Finland having the highest per capita consumption.", "expected_output": "Global coffee consumption hit a record 170M bags/year; Brazil leads production, Finland leads per capita."},
  {"input": "The electric vehicle market grew by 40% year-over-year, with Tesla maintaining its lead at 18% market share while Chinese manufacturers collectively captured 35% of global sales.", "expected_output": "EV market grew 40% YoY; Tesla holds 18% share, Chinese manufacturers collectively have 35%."},
  {"input": "A massive earthquake measuring 7.8 on the Richter scale struck southeastern Turkey, causing widespread destruction and killing over 50,000 people across Turkey and Syria.", "expected_output": "A 7.8 magnitude earthquake in southeastern Turkey killed over 50,000 in Turkey and Syria."},
  {"input": "The World Health Organization declared the end of the global health emergency for COVID-19 after more than three years, though cautioning that the virus continues to circulate.", "expected_output": "WHO ended the COVID-19 global health emergency after 3+ years but warned the virus still circulates."},
  {"input": "Apple announced its Vision Pro mixed reality headset at WWDC, priced at $3,499, featuring spatial computing capabilities and over 600 apps at launch.", "expected_output": "Apple unveiled Vision Pro MR headset at $3,499 with spatial computing and 600+ launch apps."},
  {"input": "The housing market experienced a significant cooldown with home sales dropping 18% from the previous year, largely attributed to mortgage rates exceeding 7% for the first time in two decades.", "expected_output": "Home sales fell 18% YoY as mortgage rates topped 7% for the first time in 20 years."},
  {"input": "Artificial intelligence tools like ChatGPT and Midjourney have prompted universities worldwide to revise their academic integrity policies, with some banning AI use entirely while others integrate it into curricula.", "expected_output": "AI tools prompted universities to revise integrity policies; some ban AI, others integrate it."},
  {"input": "The Amazon rainforest experienced its lowest deforestation rate in six years, with satellite data showing a 33% decrease compared to the previous year under new conservation policies.", "expected_output": "Amazon deforestation hit a 6-year low, down 33% YoY due to new conservation policies."},
  {"input": "SpaceX successfully launched its Starship rocket on its third test flight, achieving orbit for the first time and demonstrating key technologies for future Mars missions.", "expected_output": "SpaceX Starship reached orbit on its third test flight, advancing Mars mission technology."},
  {"input": "The global semiconductor shortage that began in 2020 has largely eased, with chip production capacity increasing by 25% as new fabrication plants in the US, Europe, and Asia come online.", "expected_output": "The global chip shortage has eased as production capacity grew 25% with new fabs worldwide."},
  {"input": "A new study found that microplastics are present in 90% of bottled water brands tested, with an average of 325 particles per liter, raising concerns about long-term health effects.", "expected_output": "Microplastics found in 90% of bottled water brands, averaging 325 particles/liter."},
  {"input": "The European Union passed comprehensive AI regulation requiring transparency disclosures for generative AI systems and banning real-time facial recognition in public spaces.", "expected_output": "EU passed AI regulation requiring generative AI transparency and banning public facial recognition."},
  {"input": "Global renewable energy investment surpassed fossil fuel investment for the first time in 2023, reaching $380 billion compared to $370 billion for oil, gas, and coal projects.", "expected_output": "Renewable energy investment ($380B) surpassed fossil fuels ($370B) for the first time in 2023."},
  {"input": "The average American now spends 7 hours and 4 minutes per day looking at screens, an increase of 50 minutes compared to pre-pandemic levels, according to a new survey.", "expected_output": "Americans average 7h 4m daily screen time, up 50 minutes from pre-pandemic levels."},
  {"input": "India's population officially surpassed China's to become the world's most populous country, reaching an estimated 1.43 billion people according to United Nations data.", "expected_output": "India surpassed China as the world's most populous country with 1.43 billion people."},
  {"input": "Streaming services collectively lost 50 million subscribers in Q3 as consumers cut costs amid inflation, prompting Netflix and Disney+ to introduce cheaper ad-supported tiers.", "expected_output": "Streaming services lost 50M subscribers in Q3; Netflix and Disney+ launched cheaper ad-supported plans."},
  {"input": "The Federal Reserve raised interest rates for the eleventh consecutive time, bringing the federal funds rate to a range of 5.25-5.50%, the highest level in 22 years.", "expected_output": "The Fed raised rates for the 11th straight time to 5.25-5.50%, a 22-year high."},
  {"input": "Wildfires in Canada burned over 45 million acres in 2023, the worst fire season on record, sending smoke that degraded air quality across much of the northeastern United States.", "expected_output": "Canada's record 2023 wildfires burned 45M+ acres, sending smoke across the northeastern US."},
  {"input": "A team of archaeologists unearthed a 2,000-year-old Roman mosaic floor in perfect condition beneath a farmer's field in southern England, depicting scenes from Greek mythology.", "expected_output": "A pristine 2,000-year-old Roman mosaic with Greek mythology scenes was found under a field in southern England."},
  {"input": "The global gaming industry generated $184 billion in revenue in 2023, with mobile gaming accounting for 49% of the market, followed by console gaming at 29% and PC at 22%.", "expected_output": "Gaming industry earned $184B in 2023: mobile 49%, console 29%, PC 22%."},
  {"input": "Uber reported its first-ever annual operating profit of $1.1 billion after years of losses, driven by cost-cutting measures and growth in both ride-hailing and food delivery services.", "expected_output": "Uber posted its first annual operating profit ($1.1B) from cost cuts and ride/delivery growth."},
  {"input": "Ocean temperatures reached the highest levels ever recorded in 2023, with scientists warning this could accelerate coral bleaching, intensify hurricanes, and disrupt marine ecosystems.", "expected_output": "Record ocean temperatures in 2023 threaten coral, hurricanes, and marine ecosystems."},
  {"input": "The United Auto Workers union reached a historic deal with Detroit's Big Three automakers, securing a 25% wage increase over 4.5 years and the right to strike over plant closures.", "expected_output": "UAW secured a 25% raise over 4.5 years and plant closure strike rights from Big Three automakers."},
  {"input": "Japan's population declined by over 800,000 people in a single year, the largest drop on record, as the country's birth rate fell to just 1.2 children per woman.", "expected_output": "Japan's population dropped a record 800,000+ in one year as the birth rate fell to 1.2."},
  {"input": "A clinical trial showed that a new weight loss drug reduced body weight by an average of 22.5% over 68 weeks, significantly outperforming existing treatments on the market.", "expected_output": "A new weight loss drug reduced body weight by 22.5% over 68 weeks, outperforming existing treatments."},
  {"input": "The cybersecurity industry reported a 38% increase in ransomware attacks in 2023, with the average ransom payment rising to $1.5 million as attackers targeted healthcare and education sectors.", "expected_output": "Ransomware attacks rose 38% in 2023 with $1.5M average payments, targeting healthcare and education."},
  {"input": "China's economy grew at 5.2% in 2023, meeting its official target but representing one of its slowest growth rates in decades as the property sector continued to struggle.", "expected_output": "China's economy grew 5.2% in 2023, meeting targets but among its slowest rates amid property woes."},
  {"input": "The International Space Station celebrated its 25th anniversary with six crew members aboard, having hosted over 270 astronauts from 21 countries since its first module launched in 1998.", "expected_output": "The ISS marked 25 years, having hosted 270+ astronauts from 21 countries since 1998."},
  {"input": "A new report found that the average cost of a data breach reached $4.45 million in 2023, a 15% increase over three years, with the healthcare industry facing the highest costs.", "expected_output": "Average data breach cost hit $4.45M in 2023, up 15% over 3 years; healthcare costs highest."},
  {"input": "The Tour de France saw its closest finish in 34 years, with the winner completing the 3,404-kilometer race just 7 seconds ahead of the second-place finisher.", "expected_output": "Tour de France had its closest finish in 34 years, decided by just 7 seconds over 3,404 km."},
  {"input": "Global food prices fell 13.7% from their 2022 peak according to the FAO Food Price Index, though they remained 20% above pre-pandemic levels in many developing nations.", "expected_output": "Global food prices dropped 13.7% from 2022 peak but stay 20% above pre-pandemic levels in developing nations."},
  {"input": "The world's largest offshore wind farm began operations off the coast of England, with 277 turbines generating enough electricity to power 2.5 million homes.", "expected_output": "The world's largest offshore wind farm opened off England with 277 turbines powering 2.5M homes."},
  {"input": "Twitter was rebranded to X by owner Elon Musk, who aims to transform the social media platform into an everything app offering payments, messaging, and e-commerce services.", "expected_output": "Elon Musk rebranded Twitter to X, aiming to build an everything app with payments and e-commerce."},
  {"input": "A survey of 10,000 workers found that 58% prefer hybrid work arrangements, with most wanting to work from home 2-3 days per week, while only 12% want to return to the office full-time.", "expected_output": "58% of workers prefer hybrid (2-3 days home); only 12% want full-time office return."},
  {"input": "The price of lithium, a key battery material, dropped 75% from its 2022 peak due to oversupply from new mines in Australia and Chile and slower-than-expected EV demand growth.", "expected_output": "Lithium prices fell 75% from 2022 peak due to oversupply and slower EV demand growth."},
  {"input": "The UN reported that global greenhouse gas emissions reached a record 57.4 gigatons of CO2 equivalent in 2022, with the energy sector accounting for 73% of total emissions.", "expected_output": "Global GHG emissions hit a record 57.4 Gt CO2e in 2022; energy sector responsible for 73%."},
  {"input": "South Korea's Samsung Electronics announced a $230 billion investment plan over the next 20 years to build the world's largest semiconductor manufacturing complex near Seoul.", "expected_output": "Samsung plans $230B over 20 years for the world's largest chip complex near Seoul."},
  {"input": "The Great Barrier Reef experienced its sixth mass bleaching event in nine years, with aerial surveys showing 75% of reefs affected by unprecedented ocean heat stress.", "expected_output": "The Great Barrier Reef had its 6th mass bleaching in 9 years, affecting 75% of reefs."},
  {"input": "OpenAI's valuation reached $80 billion following a tender offer, making it one of the most valuable private companies in the world and the most valuable AI startup.", "expected_output": "OpenAI reached $80B valuation, becoming the world's most valuable AI startup."},
  {"input": "The Panama Canal reduced daily ship transits from 36 to 24 due to severe drought, causing major disruptions to global trade routes and increasing shipping costs by up to 30%.", "expected_output": "Panama Canal cut transits from 36 to 24 daily due to drought, raising shipping costs up to 30%."},
  {"input": "A landmark study involving 500,000 participants found that getting 7-8 hours of sleep per night is associated with a 30% lower risk of cardiovascular disease compared to sleeping less than 6 hours.", "expected_output": "A 500K-person study found 7-8 hours of sleep lowers cardiovascular disease risk by 30% vs. under 6 hours."},
  {"input": "The global e-commerce market surpassed $6 trillion in sales for the first time, with Asia-Pacific accounting for 62% of all online retail transactions worldwide.", "expected_output": "Global e-commerce exceeded $6T; Asia-Pacific accounted for 62% of online retail."}
]
